benchmarks/vllm/runpod_h100sxm/Llama-3.1-70B/llama31_70b_TP4_DP2_in4096_out128_p500_c25_1a2719.txt
BENCHMARK: llama31_70b_TP4_DP2_in4096_out128_p500_c25_1a2719
================================================================
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x735f0fda8ea0>, seed=0, num_prompts=500, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=4096, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', base_url='http://localhost:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=25, model='/root/models/Llama-3.1-70B-Instruct', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=None, result_dir='./benchmarks/vllm/runpod_h100sxm/Llama-3.1-70B', result_filename='llama31_70b_TP4_DP2_in4096_out128_p500_c25_1a2719.json', ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='99', goodput=None, request_id_prefix='bench-cd5a893c-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None)
INFO 04-13 08:57:37 [datasets.py:612] Sampling input_len from [4095, 4095] and output_len from [128, 128]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 25

  0%|          | 0/500 [00:00<?, ?it/s]
  0%|          | 1/500 [00:05<46:32,  5.60s/it]
  1%|▏         | 7/500 [00:05<05:14,  1.57it/s]
  2%|▏         | 11/500 [00:06<03:20,  2.44it/s]
  3%|▎         | 13/500 [00:07<03:31,  2.30it/s]
  4%|▍         | 19/500 [00:07<01:46,  4.53it/s]
  5%|▌         | 25/500 [00:07<01:10,  6.74it/s]
  6%|▌         | 28/500 [00:11<02:55,  2.68it/s]
  6%|▋         | 32/500 [00:12<02:36,  3.00it/s]
  7%|▋         | 36/500 [00:12<01:51,  4.17it/s]
  8%|▊         | 38/500 [00:12<01:42,  4.52it/s]
  8%|▊         | 40/500 [00:12<01:35,  4.82it/s]
  8%|▊         | 42/500 [00:13<01:28,  5.16it/s]
  9%|▉         | 44/500 [00:14<02:02,  3.74it/s]
 10%|█         | 51/500 [00:16<02:27,  3.05it/s]
 11%|█         | 54/500 [00:17<02:05,  3.55it/s]
 12%|█▏        | 58/500 [00:17<01:36,  4.57it/s]
 12%|█▏        | 60/500 [00:18<01:40,  4.36it/s]
 13%|█▎        | 63/500 [00:19<01:44,  4.18it/s]
 14%|█▍        | 70/500 [00:19<00:55,  7.71it/s]
 15%|█▍        | 73/500 [00:20<01:26,  4.92it/s]
 15%|█▌        | 76/500 [00:22<02:16,  3.12it/s]
 16%|█▌        | 78/500 [00:22<01:55,  3.64it/s]
 16%|█▌        | 81/500 [00:22<01:35,  4.40it/s]
 17%|█▋        | 83/500 [00:23<01:43,  4.03it/s]
 17%|█▋        | 86/500 [00:24<01:38,  4.19it/s]
 18%|█▊        | 91/500 [00:24<00:59,  6.87it/s]
 19%|█▊        | 93/500 [00:25<01:31,  4.47it/s]
 20%|█▉        | 98/500 [00:26<01:28,  4.53it/s]
 20%|██        | 101/500 [00:28<02:00,  3.30it/s]
 21%|██        | 104/500 [00:28<01:44,  3.79it/s]
 21%|██▏       | 107/500 [00:29<01:32,  4.25it/s]
 22%|██▏       | 109/500 [00:29<01:30,  4.33it/s]
 22%|██▏       | 112/500 [00:29<01:15,  5.16it/s]
 23%|██▎       | 113/500 [00:30<01:22,  4.72it/s]
 23%|██▎       | 116/500 [00:30<01:10,  5.48it/s]
 23%|██▎       | 117/500 [00:31<01:21,  4.69it/s]
 24%|██▍       | 120/500 [00:31<01:18,  4.81it/s]
 25%|██▍       | 123/500 [00:32<01:14,  5.05it/s]
 25%|██▍       | 124/500 [00:32<01:32,  4.05it/s]
 25%|██▌       | 126/500 [00:33<02:06,  2.96it/s]
 25%|██▌       | 127/500 [00:33<01:55,  3.24it/s]
 26%|██▌       | 130/500 [00:34<01:26,  4.25it/s]
 26%|██▌       | 131/500 [00:34<01:37,  3.77it/s]
 27%|██▋       | 135/500 [00:35<01:04,  5.67it/s]
 27%|██▋       | 136/500 [00:35<01:14,  4.91it/s]
 28%|██▊       | 138/500 [00:35<01:06,  5.45it/s]
 28%|██▊       | 139/500 [00:36<01:14,  4.86it/s]
 28%|██▊       | 141/500 [00:36<01:13,  4.88it/s]
 29%|██▊       | 143/500 [00:36<00:55,  6.44it/s]
 29%|██▉       | 144/500 [00:36<01:07,  5.30it/s]
 29%|██▉       | 145/500 [00:37<01:34,  3.77it/s]
 29%|██▉       | 146/500 [00:37<01:36,  3.65it/s]
 30%|██▉       | 149/500 [00:38<01:13,  4.78it/s]
 30%|███       | 151/500 [00:39<02:04,  2.80it/s]
 31%|███       | 153/500 [00:39<01:47,  3.22it/s]
 31%|███       | 156/500 [00:40<01:09,  4.94it/s]
 32%|███▏      | 158/500 [00:40<01:21,  4.18it/s]
 32%|███▏      | 160/500 [00:40<01:03,  5.37it/s]
 32%|███▏      | 162/500 [00:41<01:04,  5.24it/s]
 33%|███▎      | 163/500 [00:41<01:07,  4.98it/s]
 33%|███▎      | 164/500 [00:41<01:14,  4.52it/s]
 33%|███▎      | 166/500 [00:42<01:12,  4.62it/s]
 33%|███▎      | 167/500 [00:42<01:25,  3.90it/s]
 34%|███▍      | 171/500 [00:43<01:08,  4.78it/s]
 34%|███▍      | 172/500 [00:43<01:14,  4.40it/s]
 35%|███▍      | 174/500 [00:43<00:56,  5.77it/s]
 35%|███▌      | 175/500 [00:44<01:02,  5.17it/s]
 35%|███▌      | 176/500 [00:45<02:05,  2.59it/s]
 35%|███▌      | 177/500 [00:45<01:55,  2.79it/s]
 36%|███▌      | 178/500 [00:45<01:36,  3.33it/s]
 36%|███▌      | 179/500 [00:45<01:34,  3.38it/s]
 37%|███▋      | 184/500 [00:46<00:47,  6.69it/s]
 37%|███▋      | 185/500 [00:46<01:00,  5.22it/s]
 37%|███▋      | 186/500 [00:46<00:58,  5.36it/s]
 37%|███▋      | 187/500 [00:47<01:02,  5.04it/s]
 38%|███▊      | 189/500 [00:47<00:45,  6.77it/s]
 38%|███▊      | 190/500 [00:47<01:27,  3.53it/s]
 39%|███▊      | 193/500 [00:48<01:07,  4.53it/s]
 39%|███▉      | 194/500 [00:48<01:07,  4.55it/s]
 39%|███▉      | 195/500 [00:48<01:07,  4.49it/s]
 39%|███▉      | 197/500 [00:48<00:49,  6.13it/s]
 40%|███▉      | 198/500 [00:49<00:58,  5.20it/s]
 40%|███▉      | 199/500 [00:49<01:22,  3.65it/s]
 40%|████      | 200/500 [00:49<01:11,  4.21it/s]
 40%|████      | 201/500 [00:50<01:52,  2.66it/s]
 40%|████      | 202/500 [00:51<01:52,  2.64it/s]
 41%|████      | 204/500 [00:51<01:09,  4.23it/s]
 41%|████      | 205/500 [00:51<01:22,  3.57it/s]
 41%|████      | 206/500 [00:51<01:18,  3.72it/s]
 41%|████▏     | 207/500 [00:52<01:13,  3.97it/s]
 42%|████▏     | 208/500 [00:52<01:09,  4.18it/s]
 42%|████▏     | 212/500 [00:52<00:43,  6.67it/s]
 43%|████▎     | 213/500 [00:52<00:50,  5.72it/s]
 43%|████▎     | 215/500 [00:53<00:51,  5.58it/s]
 43%|████▎     | 216/500 [00:53<01:02,  4.54it/s]
 43%|████▎     | 217/500 [00:53<01:00,  4.65it/s]
 44%|████▍     | 219/500 [00:54<01:13,  3.81it/s]
 44%|████▍     | 221/500 [00:54<01:06,  4.17it/s]
 45%|████▍     | 224/500 [00:55<00:53,  5.14it/s]
 45%|████▌     | 225/500 [00:55<00:57,  4.81it/s]
 45%|████▌     | 226/500 [00:56<01:34,  2.90it/s]
 45%|████▌     | 227/500 [00:56<01:25,  3.20it/s]
 46%|████▌     | 228/500 [00:56<01:15,  3.59it/s]
 46%|████▌     | 230/500 [00:57<01:11,  3.75it/s]
 46%|████▋     | 232/500 [00:57<01:05,  4.11it/s]
 47%|████▋     | 235/500 [00:58<00:51,  5.15it/s]
 48%|████▊     | 239/500 [00:58<00:35,  7.37it/s]
 48%|████▊     | 240/500 [00:59<00:53,  4.87it/s]
 48%|████▊     | 241/500 [00:59<00:59,  4.38it/s]
 49%|████▊     | 243/500 [00:59<00:44,  5.78it/s]
 49%|████▉     | 244/500 [01:00<01:04,  3.95it/s]
 49%|████▉     | 245/500 [01:00<01:03,  4.04it/s]
 49%|████▉     | 246/500 [01:00<00:57,  4.39it/s]
 49%|████▉     | 247/500 [01:00<00:58,  4.30it/s]
 50%|█████     | 250/500 [01:01<00:56,  4.46it/s]
 50%|█████     | 251/500 [01:02<01:26,  2.87it/s]
 51%|█████     | 254/500 [01:02<01:04,  3.83it/s]
 51%|█████     | 255/500 [01:03<01:03,  3.87it/s]
 51%|█████     | 256/500 [01:03<00:55,  4.40it/s]
 51%|█████▏    | 257/500 [01:03<01:03,  3.86it/s]
 52%|█████▏    | 261/500 [01:03<00:38,  6.13it/s]
 52%|█████▏    | 262/500 [01:04<00:46,  5.12it/s]
 53%|█████▎    | 265/500 [01:04<00:39,  5.99it/s]
 53%|█████▎    | 266/500 [01:05<00:51,  4.54it/s]
 53%|█████▎    | 267/500 [01:05<00:58,  4.01it/s]
 54%|█████▎    | 268/500 [01:05<00:52,  4.39it/s]
 54%|█████▍    | 270/500 [01:06<00:54,  4.22it/s]
 54%|█████▍    | 272/500 [01:06<00:52,  4.38it/s]
 55%|█████▍    | 273/500 [01:06<01:00,  3.77it/s]
 55%|█████▌    | 275/500 [01:07<00:53,  4.23it/s]
 55%|█████▌    | 276/500 [01:07<01:09,  3.22it/s]
 56%|█████▌    | 278/500 [01:08<01:01,  3.61it/s]
 56%|█████▌    | 280/500 [01:08<00:58,  3.79it/s]
 57%|█████▋    | 283/500 [01:09<00:44,  4.84it/s]
 57%|█████▋    | 284/500 [01:09<00:47,  4.51it/s]
 57%|█████▋    | 287/500 [01:09<00:38,  5.47it/s]
 58%|█████▊    | 290/500 [01:09<00:26,  7.83it/s]
 58%|█████▊    | 292/500 [01:10<00:46,  4.45it/s]
 59%|█████▉    | 294/500 [01:11<00:45,  4.52it/s]
 59%|█████▉    | 295/500 [01:11<00:47,  4.30it/s]
 59%|█████▉    | 296/500 [01:12<00:57,  3.52it/s]
 60%|█████▉    | 298/500 [01:12<00:40,  4.94it/s]
 60%|█████▉    | 299/500 [01:12<00:45,  4.39it/s]
 60%|██████    | 300/500 [01:13<00:54,  3.66it/s]
 60%|██████    | 301/500 [01:13<00:59,  3.33it/s]
 60%|██████    | 302/500 [01:13<00:55,  3.55it/s]
 61%|██████    | 303/500 [01:14<00:58,  3.34it/s]
 61%|██████    | 305/500 [01:14<00:51,  3.80it/s]
 62%|██████▏   | 308/500 [01:14<00:39,  4.84it/s]
 62%|██████▏   | 310/500 [01:15<00:44,  4.22it/s]
 62%|██████▏   | 312/500 [01:15<00:43,  4.34it/s]
 63%|██████▎   | 317/500 [01:16<00:33,  5.44it/s]
 64%|██████▎   | 318/500 [01:17<00:39,  4.66it/s]
 64%|██████▍   | 320/500 [01:17<00:41,  4.36it/s]
 64%|██████▍   | 321/500 [01:17<00:38,  4.64it/s]
 65%|██████▍   | 323/500 [01:18<00:35,  4.92it/s]
 65%|██████▍   | 324/500 [01:18<00:42,  4.09it/s]
 65%|██████▌   | 326/500 [01:19<00:47,  3.63it/s]
 65%|██████▌   | 327/500 [01:19<00:42,  4.03it/s]
 66%|██████▌   | 328/500 [01:19<00:44,  3.89it/s]
 66%|██████▌   | 329/500 [01:19<00:44,  3.80it/s]
 66%|██████▌   | 330/500 [01:20<00:37,  4.47it/s]
 66%|██████▌   | 331/500 [01:20<00:42,  4.02it/s]
 67%|██████▋   | 335/500 [01:21<00:36,  4.55it/s]
 67%|██████▋   | 336/500 [01:21<00:34,  4.76it/s]
 67%|██████▋   | 337/500 [01:21<00:35,  4.54it/s]
 68%|██████▊   | 340/500 [01:22<00:30,  5.32it/s]
 68%|██████▊   | 342/500 [01:22<00:30,  5.10it/s]
 69%|██████▊   | 343/500 [01:22<00:30,  5.11it/s]
 69%|██████▉   | 344/500 [01:22<00:33,  4.72it/s]
 69%|██████▉   | 345/500 [01:23<00:38,  4.00it/s]
 69%|██████▉   | 347/500 [01:23<00:27,  5.47it/s]
 70%|██████▉   | 348/500 [01:23<00:38,  3.97it/s]
 70%|██████▉   | 349/500 [01:24<00:36,  4.11it/s]
 70%|███████   | 350/500 [01:24<00:34,  4.39it/s]
 70%|███████   | 351/500 [01:24<00:47,  3.14it/s]
 70%|███████   | 352/500 [01:25<00:38,  3.84it/s]
 71%|███████   | 353/500 [01:25<00:45,  3.25it/s]
 71%|███████   | 355/500 [01:25<00:37,  3.89it/s]
 72%|███████▏  | 358/500 [01:25<00:21,  6.60it/s]
 72%|███████▏  | 360/500 [01:26<00:34,  4.09it/s]
 72%|███████▏  | 362/500 [01:27<00:31,  4.32it/s]
 73%|███████▎  | 364/500 [01:27<00:30,  4.42it/s]
 73%|███████▎  | 367/500 [01:28<00:24,  5.46it/s]
 74%|███████▎  | 368/500 [01:28<00:28,  4.56it/s]
 74%|███████▍  | 370/500 [01:29<00:31,  4.18it/s]
 74%|███████▍  | 371/500 [01:29<00:33,  3.84it/s]
 75%|███████▍  | 373/500 [01:29<00:24,  5.18it/s]
 75%|███████▍  | 374/500 [01:29<00:25,  5.01it/s]
 75%|███████▌  | 375/500 [01:29<00:23,  5.23it/s]
 75%|███████▌  | 376/500 [01:30<00:37,  3.26it/s]
 75%|███████▌  | 377/500 [01:30<00:34,  3.60it/s]
 76%|███████▌  | 378/500 [01:31<00:33,  3.61it/s]
 76%|███████▌  | 379/500 [01:31<00:29,  4.15it/s]
 76%|███████▌  | 381/500 [01:31<00:33,  3.57it/s]
 77%|███████▋  | 383/500 [01:32<00:28,  4.04it/s]
 77%|███████▋  | 387/500 [01:32<00:24,  4.68it/s]
 78%|███████▊  | 390/500 [01:33<00:20,  5.34it/s]
 78%|███████▊  | 391/500 [01:33<00:22,  4.84it/s]
 78%|███████▊  | 392/500 [01:33<00:20,  5.26it/s]
 79%|███████▉  | 394/500 [01:34<00:22,  4.63it/s]
 79%|███████▉  | 395/500 [01:34<00:22,  4.75it/s]
 79%|███████▉  | 396/500 [01:35<00:27,  3.74it/s]
 79%|███████▉  | 397/500 [01:35<00:24,  4.28it/s]
 80%|███████▉  | 398/500 [01:35<00:27,  3.70it/s]
 80%|████████  | 401/500 [01:36<00:25,  3.85it/s]
 80%|████████  | 402/500 [01:36<00:23,  4.17it/s]
 81%|████████  | 403/500 [01:36<00:24,  3.97it/s]
 81%|████████  | 404/500 [01:37<00:27,  3.44it/s]
 81%|████████▏ | 407/500 [01:37<00:19,  4.80it/s]
 82%|████████▏ | 409/500 [01:37<00:19,  4.78it/s]
 82%|████████▏ | 411/500 [01:38<00:17,  5.18it/s]
 82%|████████▏ | 412/500 [01:38<00:20,  4.35it/s]
 83%|████████▎ | 416/500 [01:39<00:17,  4.92it/s]
 83%|████████▎ | 417/500 [01:39<00:16,  5.12it/s]
 84%|████████▎ | 418/500 [01:39<00:17,  4.79it/s]
 84%|████████▍ | 419/500 [01:39<00:16,  4.93it/s]
 84%|████████▍ | 420/500 [01:40<00:20,  3.97it/s]
 84%|████████▍ | 421/500 [01:40<00:17,  4.54it/s]
 84%|████████▍ | 422/500 [01:40<00:19,  3.99it/s]
 85%|████████▍ | 423/500 [01:41<00:21,  3.64it/s]
 85%|████████▍ | 424/500 [01:41<00:25,  2.99it/s]
 85%|████████▌ | 427/500 [01:42<00:20,  3.49it/s]
 86%|████████▌ | 430/500 [01:42<00:16,  4.25it/s]
 86%|████████▋ | 432/500 [01:43<00:13,  4.98it/s]
 87%|████████▋ | 433/500 [01:43<00:15,  4.21it/s]
 87%|████████▋ | 437/500 [01:43<00:10,  6.07it/s]
 88%|████████▊ | 438/500 [01:44<00:13,  4.71it/s]
 88%|████████▊ | 439/500 [01:44<00:12,  4.76it/s]
 88%|████████▊ | 440/500 [01:44<00:12,  4.67it/s]
 88%|████████▊ | 442/500 [01:45<00:12,  4.55it/s]
 89%|████████▊ | 443/500 [01:45<00:13,  4.11it/s]
 89%|████████▉ | 445/500 [01:46<00:13,  4.20it/s]
 89%|████████▉ | 447/500 [01:46<00:13,  3.96it/s]
 90%|████████▉ | 448/500 [01:47<00:14,  3.55it/s]
 90%|████████▉ | 449/500 [01:47<00:12,  4.00it/s]
 90%|█████████ | 450/500 [01:47<00:13,  3.62it/s]
 90%|█████████ | 452/500 [01:47<00:12,  3.93it/s]
 91%|█████████ | 454/500 [01:48<00:11,  4.02it/s]
 91%|█████████ | 456/500 [01:48<00:10,  4.18it/s]
 92%|█████████▏| 458/500 [01:49<00:09,  4.61it/s]
 92%|█████████▏| 460/500 [01:49<00:08,  4.75it/s]
 93%|█████████▎| 464/500 [01:50<00:07,  4.99it/s]
 93%|█████████▎| 467/500 [01:51<00:07,  4.71it/s]
 94%|█████████▎| 468/500 [01:51<00:06,  5.06it/s]
 94%|█████████▍| 469/500 [01:51<00:06,  4.95it/s]
 94%|█████████▍| 470/500 [01:51<00:06,  4.79it/s]
 94%|█████████▍| 471/500 [01:51<00:06,  4.63it/s]
 94%|█████████▍| 472/500 [01:52<00:06,  4.39it/s]
 95%|█████████▍| 473/500 [01:52<00:08,  3.24it/s]
 95%|█████████▌| 475/500 [01:53<00:06,  3.84it/s]
 95%|█████████▌| 476/500 [01:53<00:06,  3.80it/s]
 95%|█████████▌| 477/500 [01:53<00:05,  4.34it/s]
 96%|█████████▌| 479/500 [01:53<00:03,  5.59it/s]
 96%|█████████▌| 481/500 [01:53<00:02,  7.05it/s]
 97%|█████████▋| 483/500 [01:53<00:01,  9.05it/s]
 97%|█████████▋| 485/500 [01:54<00:01, 10.65it/s]
 98%|█████████▊| 489/500 [01:54<00:00, 13.86it/s]
 98%|█████████▊| 492/500 [01:54<00:00, 12.54it/s]
 99%|█████████▉| 494/500 [01:54<00:00, 12.22it/s]
 99%|█████████▉| 497/500 [01:55<00:00,  9.67it/s]
100%|█████████▉| 499/500 [01:55<00:00,  8.40it/s]
100%|██████████| 500/500 [01:55<00:00,  4.33it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     500       
Failed requests:                         0         
Maximum request concurrency:             25        
Benchmark duration (s):                  115.57    
Total input tokens:                      2047500   
Total generated tokens:                  64000     
Request throughput (req/s):              4.33      
Output token throughput (tok/s):         553.75    
Peak output token throughput (tok/s):    1398.00   
Peak concurrent requests:                38.00     
Total token throughput (tok/s):          18269.55  
---------------Time to First Token----------------
Mean TTFT (ms):                          592.27    
Median TTFT (ms):                        357.45    
P99 TTFT (ms):                           3186.11   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          40.35     
Median TPOT (ms):                        40.97     
P99 TPOT (ms):                           49.98     
---------------Inter-token Latency----------------
Mean ITL (ms):                           40.38     
Median ITL (ms):                         18.02     
P99 ITL (ms):                            291.49    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          5716.61   
Median E2EL (ms):                        5675.04   
P99 E2EL (ms):                           7651.23   
==================================================